Replace PlantUML with Mermaid
